# Setup

In [1]:
!pip install ipython-sql
!pip install pandas

import pandas as pd
import sqlalchemy
import sqlite3


%load_ext sql
%sql sqlite://

Requirement already satisfied: ipython-sql in c:\users\19099\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython>=1.0 in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: sqlparse in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (1.3.18)
Requirement already satisfied: prettytable<1 in c:\users\19099\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: traitlets>=4.2 in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: backcall in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: decorator in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (49.2.0.post20200714)
Requirement already satisfied: pickleshare in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: jedi>=0.10 in c:\users\19099\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: wcwidth in c:\users\19099\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\19099\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: pandas in c:\users\19099\anaconda3\lib\site-packages (1.0.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\19099\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\19099\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\19099\anaconda3\lib\site-packages (from pandas) (1.18.5)
Requirement already satisfied: six>=1.5 in c:\users\19099\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

# Create Data

In [6]:
data = pd.read_csv (r'./owners.csv')
df = pd.DataFrame(data, columns= ['ownerid', 'name', 'age'])
conn = sqlite3.connect("Any_Database_Name.db")
df.to_sql('owners', conn)

ValueError: Table 'owners' already exists.

In [11]:
data = pd.read_csv (r'./cats.csv')
df = pd.DataFrame(data, columns= ['catid', 'owner', 'name', 'age'])
df.to_sql('cats', conn)

In [7]:
df = pd.read_sql("SELECT * FROM owners", conn)
df = df.set_index("ownerid")
df.loc[:,["name", "age"]]

             name  age
ownerid
1           Daryl   20
2             Mil   21
3            Eric   20
4           Jihee   21
5             Sue   21
6           Vicky   21
7            Andy   20
8           Cindy   20
9           Aryan   20
10          Kelly   21
11          Carol    5
12           Eric   21
13       Steffany   21
14         Austin   20
15        Tiffany   21

In [14]:
df = pd.read_sql("SELECT * FROM cats", conn)
df.loc[:,["catid", "owner", "name", "age"]]

    catid  owner               name  age
0       1      3  Alessandro Arroyo    9
1       2     10        Eliot Morin    1
2       3      2      Bushra Rahman    5
3       4     11  Cillian Rodriguez    4
4       5     10      Coby Stephens    3
5       6     14      Mercy English    5
6       7      3       Harriet Lynn    1
7       8     15     Hettie Alvarez    9
8       9      9      Ebony Andrews    3
9      10      3    Eryk Mclaughlin   10
10     11      3      Nawal English    1
11     12     10    Jeanette Reeves    1
12     13     12       Fardeen Clay    3
13     14      8        Kaya Morley    9
14     15      2     Zavier Marsden    6
15     16     14  Daniel Stephenson    8
16     17     15      Brenna Wagner    1
17     18      1        Ollie Mills    2
18     19      9   Romilly Fletcher    4
19     20      1          Janice Le    4
20     21      8        Sid Skinner   10
21     22     14      Kaeden Hollis    5
22     23     11       Annette Pate    2
23     24     11       Steven Jones    2
24     25     15           Eve Roth    3